;; -*- no-byte-compile: t; -*-

(package! aider :recipe (:host github :repo "tninja/aider.el" :files ("aider*.el")))
(package! casual)
(package! centered-window)
(package! command-log-mode)
(package! company-box)
(package! company-lsp)
(package! copilot :recipe (:host github :repo "copilot-emacs/copilot.el" :files ("*.el")))
(package! copilot-chat :recipe (:host github :repo "chep/copilot-chat.el" :files ("*.el")))
(package! dash-at-point)
(package! evil-cleverparens)
(package! evil-iedit-state)
(package! evil-lion)
(package! evil-matchit)
(package! evil-quickscope)
(package! evil-rails)
(package! evil-ruby-text-objects)
(package! evil-string-inflection)
(package! evil-tex)
(package! evil-unimpaired :recipe (:host github :repo "zmaas/evil-unimpaired"))
(package! exercism)
(package! ggtags :recipe (:host github :repo "leoliu/ggtags"))
(package! gxref :recipe (:host github :repo "dedi/gxref"))
(package! impatient-mode :recipe (:host github :repo "skeeto/impatient-mode"))
(package! jest)
(package! ob-mermaid)
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
(package! org-fancy-priorities)
(package! org-projectile)
(package! org-superstar)
(package! ox-gfm)
(package! posframe)
(package! prettier-js)
(package! ruby-refactor)
(package! ruby-test-mode)
(package! seeing-is-believing)
(package! typopunct)
(package! vimrc-mode)
(package! xenops)
(package! xwwp :recipe (:host github :repo "canatella/xwwp"))
(package! yankee :recipe (:host github :repo "jmromer/yankee.el" :files ("yankee.el")))

(disable-packages! minitest)
(disable-packages! company-gtags)
(disable-packages! evil-snipe)
(disable-packages! git-gutter)
(disable-packages! git-gutter-fringe)
